#+title: Упрощение форматированного вывода исходного кода Haskell

Пакет =TH= (/Template Haskell/) содержит возможности форматированного вывода конструкций типа ~Exp~ с
помощью функции ~Ppr.pprint~.

* Постановка задачи

Функция ~pprint~ позволяет красиво распечатать любое выражение, полученное в брикетах =Template Haskell=.

#+begin_src haskell :results none
  :set -XTemplateHaskell
  :set -package template-haskell
  :m +Language.Haskell.TH
  :m +Language.Haskell.TH.Syntax

  e <- runQ [| a + b |]
#+end_src

Если теперь выполнить ~pprint e~, получим:

src_haskell{pprint e} {{{results(=a GHC.Num.+ b=)}}}

Тут, однако, сложность в том, что все глобальные переменные показываются с полным путем контекста. Это
усложняет чтение выражения, так как простой арифметический знак ~+~ превращаеется в полное имя. Это не
всегда нужно. Проще всего обойти это простой заменой всех имен на неквалифицированные. При этом
достаточно заменить конструктор ~NameG~ на ~NameS~. Для начала посмотрим структуру выражения с помощью
~show e~:

src_haskell{show e} {{{results(=InfixE (Just (UnboundVarE a)) (VarE GHC.Num.+) (Just (UnboundVarE b))=)}}}

Определим функцию ~simplify~, которая в этом выражении заменяет имя.

#+begin_src haskell :results none
  :{
     simplify :: Exp -> Exp
     simplify (InfixE (Just e1) op (Just e2)) = InfixE (Just $ simplify e1) (simplify op) (Just $ simplify e2)
     simplify (VarE (Name occ _)) = VarE (Name occ NameS)
     simplify e = e
  :}
#+end_src

#+begin_src haskell :results none
  let a = 1
  e <- runQ [| a + b |]  
#+end_src

#+begin_src haskell
  pprint $ simplify e
#+end_src

#+RESULTS:
: a + b

